import { Box, Text } from '@chakra-ui/react';

export default function Page() {
    return (
        <Box as="main" p="24px">
            <Text>
                본 약관은 썸BTI(이하 “회사“)가 제공하는 서비스 이용과 관련하여, 사용자로부터 수집하는 개인정보의 수집,
                이용, 처리 및 보호와 관련된 내용을 규정합니다.
                <br />
                <br />
                제1조 (개인정보 수집 항목)
                <br />
                필수 수집 항목: 사용자: 이름, 성별, MBTI, 생년월일 선택 수집 항목: 사용자: 직업, 형제 관계, 관심사,
                취미, 연애 경험 상대방: 이름, 성별, MBTI, 생년월일, 직업, 형제 관계, 관심사, 취미, 연애 경험 관계 정보:
                상대방과의 관계, 만남 히스토리 (만남 계기, 알고 지낸 기간, 만남 횟수, 만남 빈도, 연락 패턴) 사용자가
                가입 이후 추가적으로 기입하는 본인 또는 상대방의 상세 정보
                <br />
                <br />
                제2조 (개인정보의 수집 및 이용 목적)
                <br />
                사용자 맞춤형 연애 코칭 및 서비스 제공 사용자 및 상대방 정보 기반의 맞춤형 추천 및 분석 서비스 개선 및
                사용자 경험 향상 고객 지원 및 문의 처리 마케팅 및 프로모션 정보 제공 (선택적)
                <br />
                <br />
                제3조 (개인정보의 보유 및 이용 기간)
                <br /> 개인정보는 회원 탈퇴 시까지 보유하며, 탈퇴 후에는 즉시 삭제됩니다. 법령에 따라 보존이 필요한 경우
                해당 법령에 따라 일정 기간 동안 보유할 수 있습니다
                <br />
                <br /> 제4조 (개인정보의 제3자 제공)
                <br />
                원칙적으로 사용자의 개인정보를 제3자에게 제공하지 않습니다. 단, 연애 코칭 서비스 제공을 위해
                하이퍼클로바X에 정보를 전달하는 것이 필수적이며, 이 경우 회사는 사용자의 서비스 가입을 명시적 동의로
                간주하여 해당 정보를 제공할 수 있습니다.
                <br />
                <br />
                제5조 (개인정보의 보호)
                <br />
                회사는 사용자의 개인정보를 안전하게 보호하기 위해 암호화 및 기타 보안 조치를 시행합니다. 개인정보 처리
                담당자 외 접근을 제한하며, 지속적인 보안 점검을 실시합니다.
                <br />
                <br />
                제6조 (이용자의 권리)
                <br />
                사용자는 언제든지 개인정보 열람, 수정, 삭제를 요청할 수 있습니다. 개인정보 관련
                문의는 jjneurons@naver.com으로 연락할 수 있습니다.
                <br />
                <br />
                제7조 (동의 철회)
                <br />
                사용자는 언제든지 개인정보 이용 동의를 철회할 수 있습니다. 동의 철회 시 서비스 이용에 제한이 있을 수
                있습니다.
                <br />
                <br />
                제8조 (책임의 한계)
                <br />
                회사는 사용자가 제공한 개인정보의 정확성을 보장하지 않으며, 사용자가 제공한 정보에 대한 책임은
                사용자에게 있습니다. 회사는 개인정보 유출, 변조, 침해 등의 방지를 위해 최선의 노력을 다하며, 관련 법령에
                따라 책임을 부담합니다.
                <br />
                <br />
                제9조 (약관 변경)
                <br />본 약관은 필요에 따라 변경될 수 있으며, 변경 사항은 앱 내 공지사항을 통해 사전에 고지합니다.
                변경된 약관에 대한 사용자의 동의가 필요한 경우, 별도의 동의 절차를 거칩니다.
            </Text>
        </Box>
    );
}
