import { Box, Text } from '@chakra-ui/react';

export default function Page() {
    return (
        <Box as="main" p="24px">
            <Text>
                본 약관은 썸BTI(이하 “회사“)가 제공하는 연애 코칭 서비스(이하 “서비스“)의 이용과 관련하여 회사와
                회원(이하 “사용자“) 간의 권리와 의무, 책임사항 등을 규정함을 목적으로 합니다. 제1조 (목적)본 약관은
                회사가 제공하는 서비스의 이용조건 및 절차, 회사와 사용자 간의 권리, 의무, 책임 사항, 기타 필요한 사항을
                규정합니다. 제2조 (정의) “서비스“란 회사가 제공하는 연애 코칭을 위한 일체의 서비스를 의미합니다.
                “사용자“란 본 약관에 동의하고 회사가 제공하는 서비스를 이용하는 자를 말합니다. 제3조 (약관의 게시 및
                개정) 본 약관은 서비스 초기 화면 또는 기타 방법으로 사용자에게 공지됩니다. 회사는 필요에 따라 본 약관을
                개정할 수 있으며, 개정된 약관은 공지 또는 통지 후 효력이 발생합니다. 사용자가 개정 약관에 동의하지 않는
                경우, 서비스 이용을 중단하고 탈퇴할 수 있습니다. 제4조 (이용 계약의 성립) 서비스 이용 계약은 사용자가 본
                약관에 동의하고 서비스 가입 신청을 하여 회사가 이를 승낙함으로써 성립됩니다. 회사는 다음 각 호의 경우
                이용 계약의 승낙을 거절할 수 있습니다: 타인의 정보를 도용한 경우 기타 관련 법령에 위반되는 경우 제5조
                (서비스의 이용) 사용자는 회사가 제공하는 서비스를 본 약관 및 회사의 정책에 따라 이용해야 합니다. 서비스
                이용에 필요한 일부 기능은 추가 요금이 발생할 수 있으며, 결제 관련 내용은 추후 공지합니다. 제6조 (서비스
                제공의 중단)회사는 다음과 같은 경우 서비스 제공을 중단할 수 있습니다: 설비 점검, 유지보수 등 불가피한
                사유가 발생한 경우 천재지변, 비상사태 등 불가항력적 사유로 인해 서비스 제공이 어려운 경우 제7조 (책임의
                한계) 회사는 본 서비스에서 제공하는 정보 및 코칭 내용의 정확성, 완전성, 신뢰성에 대해 보증하지 않으며,
                사용자 개인의 선택에 따른 결과에 대한 책임을 지지 않습니다. 회사는 사용자가 서비스를 이용함에 있어
                발생하는 모든 손해에 대해 책임을 지지 않으며, 사용자는 본인의 책임 하에 서비스를 이용해야 합니다. 제8조
                (약관 변경)회사는 본 약관을 변경할 수 있으며, 변경된 약관은 공지 또는 통지를 통해 사용자에게 전달됩니다.
                제9조 (기타) 본 약관에 명시되지 않은 사항은 관련 법령 및 회사의 정책에 따릅니다. 사용자는 서비스와
                관련된 문의사항을 jjneurons@naver.com으로 연락할 수 있습니다.
            </Text>
        </Box>
    );
}
